# Python Pandas Tutorial 8. Concat Dataframes

In [1]:
import pandas as pd

In [4]:
pakistan_data = pd.DataFrame({
    'city': ['Karachi', 'Hyderabad', 'Lahore'],
    'temperature': [32, 45, 30],
    'humudity': [80, 60, 78]
})

pakistan_data

        city  temperature  humudity
0    Karachi           32        80
1  Hyderabad           45        60
2     Lahore           30        78

In [5]:
us_data = pd.DataFrame({
    'city': ['New York', 'Chicago', 'Washington'],
    'temperature': [21, 14, 35],
    'humudity': [68, 65, 75]
})

us_data

         city  temperature  humudity
0    New York           21        68
1     Chicago           14        65
2  Washington           35        75

In [8]:
df = pd.concat([pakistan_data, us_data], ignore_index=True)
df

         city  temperature  humudity
0     Karachi           32        80
1   Hyderabad           45        60
2      Lahore           30        78
3    New York           21        68
4     Chicago           14        65
5  Washington           35        75

In [13]:
df = pd.concat([pakistan_data, us_data], keys=['pak', 'us'])
df

             city  temperature  humudity
pak 0     Karachi           32        80
    1   Hyderabad           45        60
    2      Lahore           30        78
us  0    New York           21        68
    1     Chicago           14        65
    2  Washington           35        75

In [15]:
df.loc['pak']

        city  temperature  humudity
0    Karachi           32        80
1  Hyderabad           45        60
2     Lahore           30        78

In [17]:
temperature_df = pd.DataFrame({
    'city': ['New York', 'Chicago', 'Washington'],
    'temperature': [21, 14, 35],
})

temperature_df

         city  temperature
0    New York           21
1     Chicago           14
2  Washington           35

In [27]:
windspeed_df = pd.DataFrame({
    'city': ['New York', 'Washington'],
    'windspeed': [7, 12],
}, index=[1,0])

windspeed_df

         city  windspeed
1    New York          7
0  Washington         12

In [30]:
df = pd.concat([temperature_df, windspeed_df], axis=1)
df

         city  temperature        city  windspeed
0    New York           21    New York        7.0
1     Chicago           14  Washington       12.0
2  Washington           35         NaN        NaN

In [31]:
s = pd.Series(['Humid', 'Dry', 'Rain'], name='event')
s

0    Humid
1      Dry
2     Rain
Name: event, dtype: object

In [32]:
df = pd.concat([temperature_df, s], axis=1)
df

         city  temperature  event
0    New York           21  Humid
1     Chicago           14    Dry
2  Washington           35   Rain

# Merge Dataframes

In [33]:
import pandas as pd

In [36]:
df1 = pd.DataFrame({
    'city': ['New York', 'Chicago', 'OrLando'],
    'temperature': [21,14,35]
})

df1

       city  temperature
0  New York           21
1   Chicago           14
2   OrLando           35

In [37]:
df2 = pd.DataFrame({
    'city': ['New York', 'Chicago', 'OrLando'],
    'humidity': [65,68,75]
})

df2

       city  humidity
0  New York        65
1   Chicago        68
2   OrLando        75

In [39]:
merge_df = pd.merge(df1, df2, on='city')
merge_df

       city  temperature  humidity
0  New York           21        65
1   Chicago           14        68
2   OrLando           35        75